Autodesk.Revit.DB.Structure.IRebarSpliceServer.CanKeepSpliceConnectionAtEnd(Autodesk.Revit.DB.Structure.Rebar,System.Int32)
This will method will be called for the bars that are involved in splice.
rebar:
The Rebar element that needs to be checked.
barEnd:
The bar end where is the splice connection that needs to be checked.
Returns:
Returns true if the splice connection can be kept, false otherwise.

Autodesk.Revit.DB.Structure.IRebarSpliceServer.SetPreferredConstraint(Autodesk.Revit.DB.Structure.RebarConstraint)
This will method will be called for the bars that are involved in splice.
The implmentation should set the desired constraint on this bar (it can be exaclty the input one) or it can set
new constraints to this bar or other bars.
While setting constraints from this function to a bar that is in the same splice chain, it will not be called again.
constraint:
The constraint that is required to be set.

Autodesk.Revit.DB.Structure.IRebarSpliceServer.UpdateShiftedBarInSplice(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.Int32)
Override this function to update the rebar at the specified end when splice shift option (RebarSpliceShiftOption enum) is changed.
document:
The document.
rebarId:
The bar id.
barEnd:
The bar end where the shift was changed.

Autodesk.Revit.DB.Structure.IRebarSpliceServer.SpliceRebar(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Structure.RebarSpliceOptions,System.Collections.Generic.IList{Autodesk.Revit.DB.Structure.RebarSpliceGeometry})
Override this function to splice the rebar.
document:
The document.
rebarToSplice:
The rebar that will be spliced.
spliceOptions:
The rebar splice options.
spliceGeometries:
The splice geometries where this rebar will be spliced.
Returns:
Returns the ids of the rebars that are considerred to be spliced.
This array may contain ids of new created rebars, or the id of the input one.